# BendingDetailTypeAngularDimensionTypeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeAngularDimensionTypeId Property
ParameterTypeId Class See Also
---
"Angular Dimension Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeAngularDimensionTypeId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeAngularDimensionTypeId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeAngularDimensionTypeId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace